In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
from sklearn import linear_model

In [8]:
d={
    'area':[2600,3000,3200,3600,4000],
    'bedrooms':[3,4,None,3,5],
    'age':[20,15,18,30,8],
    'price':[550000,565000,610000,595000,760000]
}
df = pd.DataFrame(d)
df

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       NaN   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000

In [16]:
import math
median_bedrooms = math.floor(df.bedrooms.median())

In [17]:
median_bedrooms

3

In [22]:
df.fillna({
    'bedrooms':median_bedrooms
})

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       3.0   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000

In [23]:
df

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       3.0   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000

In [29]:
reg = linear_model.LinearRegression()
reg.fit(df.drop('price',axis=1),df.price)

LinearRegression()

In [31]:
reg.coef_

array([   137.25, -26025.  ,  -6825.  ])

In [32]:
reg.intercept_

383724.9999999998

In [34]:
reg.predict([[3000,3,15]])

C:\Users\Thinkpad\anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([615025.])

In [35]:
137.25*3000-26025*3-6825*15+383724.9999999998

615024.9999999998